results/pgbench-tpcb/60m/thph/tps-128
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 3000
query mode: simple
number of clients: 128
number of threads: 128
duration: 3600 s
number of transactions actually processed: 139451817
latency average = 3.304 ms
tps = 38736.203817 (including connections establishing)
tps = 38736.656165 (excluding connections establishing)

 Performance counter stats for './pgbench db -U ibrar -T 3600 -j 128 -c 128':

 4,605,006,255,400      dTLB-loads                                                    (63.16%)
   159,480,223,328      dTLB-load-misses          #    3.46% of all dTLB cache hits   (58.24%)
    21,445,131,549      iTLB-loads                                                    (58.83%)
    58,920,918,298      iTLB-load-misses          #  274.75% of all iTLB cache hits   (75.93%)

    3601.699068279 seconds time elapsed

starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 3000
query mode: simple
number of clients: 128
number of threads: 128
duration: 3600 s
number of transactions actually processed: 139575171
latency average = 3.302 ms
tps = 38770.104663 (including connections establishing)
tps = 38770.441652 (excluding connections establishing)

 Performance counter stats for './pgbench db -U ibrar -T 3600 -j 128 -c 128':

 4,608,257,607,921      dTLB-loads                                                    (63.15%)
   158,295,208,886      dTLB-load-misses          #    3.44% of all dTLB cache hits   (58.22%)
    23,039,300,855      iTLB-loads                                                    (58.81%)
    60,697,722,925      iTLB-load-misses          #  263.45% of all iTLB cache hits   (75.94%)

    3601.910375810 seconds time elapsed

starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 3000
query mode: simple
number of clients: 128
number of threads: 128
duration: 3600 s
number of transactions actually processed: 140060749
latency average = 3.290 ms
tps = 38905.405093 (including connections establishing)
tps = 38905.771352 (excluding connections establishing)

 Performance counter stats for './pgbench db -U ibrar -T 3600 -j 128 -c 128':

 4,626,540,902,262      dTLB-loads                                                    (63.12%)
   159,283,166,939      dTLB-load-misses          #    3.44% of all dTLB cache hits   (58.25%)
    22,278,000,618      iTLB-loads                                                    (58.81%)
    60,450,264,006      iTLB-load-misses          #  271.35% of all iTLB cache hits   (75.91%)

    3601.778032387 seconds time elapsed

starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 7000
query mode: simple
number of clients: 128
number of threads: 128
duration: 3600 s
number of transactions actually processed: 125065159
latency average = 3.684 ms
tps = 34740.260430 (including connections establishing)
tps = 34740.529021 (excluding connections establishing)

 Performance counter stats for './pgbench db -U ibrar -T 3600 -j 128 -c 128':

 4,178,463,881,345      dTLB-loads                                                    (64.48%)
   140,743,555,184      dTLB-load-misses          #    3.37% of all dTLB cache hits   (59.64%)
    19,952,091,564      iTLB-loads                                                    (60.24%)
    58,452,366,580      iTLB-load-misses          #  292.96% of all iTLB cache hits   (76.83%)

    3601.173666977 seconds time elapsed

starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 7000
query mode: simple
number of clients: 128
number of threads: 128
duration: 3600 s
number of transactions actually processed: 124373642
latency average = 3.705 ms
tps = 34547.771354 (including connections establishing)
tps = 34548.194927 (excluding connections establishing)

 Performance counter stats for './pgbench db -U ibrar -T 3600 -j 128 -c 128':

 4,151,939,767,963      dTLB-loads                                                    (64.45%)
   137,979,703,294      dTLB-load-misses          #    3.32% of all dTLB cache hits   (59.66%)
    20,605,807,345      iTLB-loads                                                    (60.21%)
    61,709,721,896      iTLB-load-misses          #  299.48% of all iTLB cache hits   (76.78%)

    3600.881636381 seconds time elapsed

starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 7000
query mode: simple
number of clients: 128
number of threads: 128
duration: 3600 s
number of transactions actually processed: 124290931
latency average = 3.707 ms
tps = 34524.957619 (including connections establishing)
tps = 34525.243379 (excluding connections establishing)

 Performance counter stats for './pgbench db -U ibrar -T 3600 -j 128 -c 128':

 4,148,200,565,867      dTLB-loads                                                    (64.42%)
   137,033,018,901      dTLB-load-misses          #    3.30% of all dTLB cache hits   (59.63%)
    21,391,414,226      iTLB-loads                                                    (60.21%)
    51,605,360,993      iTLB-load-misses          #  241.24% of all iTLB cache hits   (76.81%)

    3601.775411662 seconds time elapsed